""" Модуль для отримання даних про рух основних засобів
"""

def get_dovidnik():
    """ Повертає вміст файла "dovidnik.txt" у вигляді списка

    Returns:
        dovidnik_list - список рядків файла
    """

    dovidnik_list = [
        "1; Будівлі",
        "2; Машини та обладнання",
        "3; Транспортні засоби",
        "4; Інструмент та інвентар"
    ]

    return dovidnik_list


dovidnik_list = get_dovidnik()
print(dovidnik_list)



def get_move_means():
    """ Повертає вміст файла "move_means.txt" у вигляді списка
    Returns:
        move_means_list - список рядків файла
    """

    move_means_list = [
        "Універсам 22; 1; 44 048,00; 500,00; 200,00",
        "Дніпрянка; 1; 22 456,00; 365,00; 123,00",
        "Універсам 22; 2; 5 564,00; 2 571,00; 135,00",
        "Дніпрянка; 2; 10 087,00; 15 972,00; 58,00",
        "Універсам 22; 3; 0,00; 0,00; 0,00",
        "Дніпрянка; 3; 206,00; 34,00; 50,00",
        "Універсам 22; 4; 116,00; 64,00; 23,00",
        "Дніпрянка; 4; 34,00; 23,00; 25,00"
    ]

    return move_means_list


move_means_list = get_move_means()
print(move_means_list)